# Здесь расположим КОНСТАНТЫ наших всех команд
# //----------------------------------------------------------------------------------------------------------------
#                                           Команды протокола RTU-327.
# //----------------------------------------------------------------------------------------------------------------

# ЗДЕСЬ СОДЕРЖАТСЯ НОМЕРА КОМАНД ,
# НУЖНЫ ДЛЯ ФОРМИРОВАНИЯ ЗАПРОСОВ
# Название : Код команды(идентификатор)


command_bank = {

    #                                        # Команды протокола версии 2.x

    # Запрос версии
    'GETVERSION': 3,

    # Запрос текущего времени
    'GETTIME': 114,

    # Коррекция времени
    'SETTIME': 115,

    # Получить максимальный номер события журнала событий RTU
    'GETMAXLOGID': 101,

    # Запрос журнала событий
    'GETLOG': 117,

    # Запрос параметров счетчика
    'GETSHPRM': 112,

    # Запрос расчетных показаний счетчика на указанное время
    'GETPOK': 113,

    # Запрос коммерческого профиля нагрузки
    'GETLP': 111,

    # Запрос оперативного ПН
    'GETSHORTLP': 105,

    # Запрос параметров эл-сети
    'GETTESTS': 107,

    # Запрос таблицы авточтений
    'GETAUTOREAD': 109,

    # Запрос журнала событий по счетчику
    'GETMTRLOG': 116,

    #                                        # Команды протокола версии 3.x

    # Запрос профиля любого типа, показаний счетчика и параметров точки учета
    'GETLPCMN': 118,

    # Запрос текущих и предыдущих тарифных показаний счетчиков
    'GETTOU': 119,

    #                                        # Команды протокола версии 3.25

    # Получить текущее время УСПД до миллисекунд
    'GETTIMEM': 122,

    # Коррекция времени УСПД до милисекунд
    'SETTIMEM': 123,
}

# //----------------------------------------------------------------------------------------------------------------
#                        Все пакеты идущие от RTU-327 к клиентам имеют следующий формат
# //----------------------------------------------------------------------------------------------------------------
template_answer = {
    # Х UINT8 Префиксный байт (имеет значение 0х02)
    'Х': [0],
    # NN UINT16 Длина пакета без учета X,NN,KK
    'NN': [1, 2],
    # II UINT16 Порядковый номер пакета
    'II': [3, 4],
    # АААА 4 байта Резерв
    'АААА': [5, 6, 7, 8],
    # SS 2 байт Резерв
    'SS': [9, 10],
    # RR UINT8 код результата. 0 – ОК , иначе – код ошибки.
    'RR': [11],
    # DD… Переменная Данные. Ответ на команду-запрос (зависят от типа команды)
    'DD': [],
    # КК UINT16 CRC – контрольная сумма
    'КК': [-1, -2]
}

# Здесь расположим значения по умолчанию

answer_default_values = \
    {
        # Х UINT8 Префиксный байт (имеет значение 0х02)
        'Х': [b'\x02'],
        # NN UINT16 Длина пакета без учета X,NN,KK
        'NN': None,
        # II UINT16 Порядковый номер пакета
        'II': [b'\x01', b'\x00'],
        # АААА 4 байта Резерв
        'АААА': [b'\x00', b'\x00', b'\x00', b'\x00'],
        # SS 2 байт Резерв
        'SS': [b'\x00', b'\x00'],
        # RR UINT8 код результата. 0 – ОК , иначе – код ошибки.
        'RR': [b'\x00'],
        # DD… Переменная Данные. Ответ на команду-запрос (зависят от типа команды)
        'DD': None,
        # КК UINT16 CRC – контрольная сумма
        'КК': None
    }

# //----------------------------------------------------------------------------------------------------------------
#                       Все пакеты, идущие от клиентов к RTU-327 имеют следующий формат:
# //----------------------------------------------------------------------------------------------------------------


# //----------------------------------------------------------------------------------------------------------------
#                               ИТАК ЗДЕСЬ РАСПОЛОЖИМ РАСШИФРОВКИ ОШИБОК
# //----------------------------------------------------------------------------------------------------------------
error_code_dict = \
    {
        0: 'ОШИБОК НЕТ',
        1: 'Ошибка сервера',
        2: 'Данных больше нет',
        3: 'Ошибка базы данных RTU-327',
        5: 'Неверная команда',
        6: 'Неверные параметры',
        10: 'Неверный пароль',
        11: 'Нет прав на проведение операции',
        60: 'Ошибка CRC приемного пакета',
    }

# //----------------------------------------------------------------------------------------------------------------
#                       ИТАК ЗДЕСЬ ВЫВОДИМ СООТВЕТСИЯ между RTU ID счетчиками и ID нашими :
# //----------------------------------------------------------------------------------------------------------------

MeterId_To_RTU327_dict = {
    1: 'RTU_METER_ALPHA',
    2: 'RTU_METER_EUROALPHA11',
    3: 'RTU_METER_EUROALPHA10',
    4: 'RTU_METER_ALPHAPLUS',
    5: 'RTU_METER_A1170',
    6: 'RTU_METER_PSCHxTM',
    7: 'RTU_METER_SET4TM',
    8: 'RTU_METER_A3',
    9: 'RTU_METER_CC300',
    10: 'RTU_METER_A1800',
    11: 'RTU_METER_A1140',
    12: 'RTU_METER_SL7x',
    13: 'RTU_METER_CE303',
    14: 'RTU_METER_EPQS',
    15: 'RTU_METER_MERCURY230',
    16: 'RTU_METER_LZQM',
    17: 'RTU_METER_MERCURY200',
    18: 'RTU_METER_ZMD',
    19: 'RTU_METER_EMH',
    20: 'RTU_METER_ZMG',
    22: 'RTU_METER_HAMMA32',
    23: 'RTU_METER_DTSD546',
    24: 'RTU_METER_NIK2303',
    100: 'RTU_METER_NO_TYPE',

    # И ОБРАТНО
    'RTU_METER_ALPHA': 1,
    'RTU_METER_EUROALPHA11': 2,
    'RTU_METER_EUROALPHA10': 3,
    'RTU_METER_ALPHAPLUS': 4,
    'RTU_METER_A1170': 5,
    'RTU_METER_PSCHxTM': 6,
    'RTU_METER_SET4TM': 7,
    'RTU_METER_A3': 8,
    'RTU_METER_CC300': 9,
    'RTU_METER_A1800': 10,
    'RTU_METER_A1140': 11,
    'RTU_METER_SL7x': 12,
    'RTU_METER_CE303': 13,
    'RTU_METER_EPQS': 14,
    'RTU_METER_MERCURY230': 15,
    'RTU_METER_LZQM': 16,
    'RTU_METER_MERCURY200': 17,
    'RTU_METER_ZMD': 18,
    'RTU_METER_EMH': 19,
    'RTU_METER_ZMG': 20,
    'RTU_METER_HAMMA32': 22,
    'RTU_METER_DTSD546': 23,
    'RTU_METER_NIK2303': 24,
    'RTU_METER_NO_TYPE': 100,

}

MeterId_conformity_RTU_to_RTU = \
    {
        'RTU_METER_MERCURY230': "Mercury23x",
        'RTU_METER_MERCURY200': "Mercury200",
        'RTU_METER_SET4TM': "SETxTM",
        'RTU_METER_CE303': "SE303",
        'RTU_METER_PSCHxTM': "PSCHxTM",
        'RTU_METER_A1140': "A1140",

        # В КАЧЕСТВЕ ВСЕГО ОСТАЛЬНОГО СТАВИМ ЭНЕРГОМЕРУ 301
        'RTU_METER_NO_TYPE': "SE301",

        # И ОБРАТНО
        "Mercury23x": 'RTU_METER_MERCURY230',
        "Mercury200": 'RTU_METER_MERCURY200',
        "SETxTM": 'RTU_METER_SET4TM',
        "SE303": 'RTU_METER_CE303',
        "PSCHxTM": 'RTU_METER_PSCHxTM',
        "A1140": 'RTU_METER_A1140',

        # В КАЧЕСТВЕ ВСЕГО ОСТАЛЬНОГО СТАВИМ ЭНЕРГОМЕРУ 301
        "SE301": 'RTU_METER_NO_TYPE'

    }

MeterId_To_USPD_dict = {
    'Mercury200': 1,
    'SEB2a': 2,
    'Mercury23x': 3,
    'SETxTM': 4,
    'SE303': 5,
    'SE301': 6,
    'SE102': 8,
    'UMTV10': 9,
    'PSCHxTM': 10,
    'SE102M': 11,
    'SOE55_217': 22,
    'STE561': 23,
    'SOE55_215': 24,
    'A1140': 25,
    'NEVA1xx': 26,
    'NEVA3xx': 27,
    'MILUR10x': 28,
    'MILUR30x': 29,
    'SOE55_415': 30,
    'Mercury203': 31,
    'Mercury206': 32,
    'TOPAZ': 33,
    'CASCAD': 34,
    'INTEGRA10x': 35,
    'SPODES': 36,
    'Pulsar': 93,
    'MILUR IC': 94,
    'ST410': 192,

    # И ОБРАТНО
    1: "Mercury200",
    2: "SEB2a",
    3: "Mercury23x",
    4: "SETxTM",
    5: "SE303",
    6: "SE301",
    8: "SE102",
    9: "UMTV10",
    10: "PSCHxTM",
    11: "SE102M",
    22: "SOE55_217",
    23: "STE561",
    24: "SOE55_215",
    25: "A1140",
    26: "NEVA1xx",
    27: "NEVA3xx",
    28: "MILUR10x",
    29: "MILUR30x",
    30: "SOE55_415",
    31: "Mercury203",
    32: "Mercury206",
    33: "TOPAZ",
    34: "CASCAD",
    35: "INTEGRA10x",
    36: "SPODES",
    93: "Pulsar",
    94: "MILUR IC",
    192: "ST410",
}
